heart = ['□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□■■■□□□■■■□□□\n□□■■■■■□■■■■■■□\n□■■■■■■■■■■■■■□\n□■■■■■■■■■■■■■□\n□□■■■■■■■■■■■□□\n□□□■■■■■■■■□□□□\n□□□□□■■■■■□□□□□\n□□□□□□■■■□□□□□□\n□□□□□□□■□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n',
         '□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□■■■□□□□□■■■□□\n□■■■■■□□□■■■■■■\n■■■■■■■□■■■■■■■\n■■■■■■■□■■■■■■■\n□■■■■■■□■■■■■■□\n□□■■■■■□■■■■□□□\n□□□□■■■□■■■□□□□\n□□□□□■■□■■□□□□□\n□□□□□□■□■□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n',
         '□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□■■■□□□□□□□■■■□\n■■■■■□□□□□■■■■■\n■■■■■■□□□■■■■■■\n■■■■■■□□□■■■■■■\n■■■■■■□□□■■■■■■\n□■■■■■□□□■■■■□□\n□□□■■■□□□■■■□□□\n□□□□■■□□□■■□□□□\n□□□□□■□□□■□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n',
         '□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n■■■□□□□□□□□□■■■\n■■■■□□□□□□□■■■■\n■■■■■□□□□□■■■■■\n■■■■■□□□□□■■■■■\n■■■■■□□□□□■■■■■\n■■■■■□□□□□■■■■■\n□□■■■□□□□□■■■□□\n□□□■■□□□□□■■□□□\n□□□□■□□□□□■□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n',
         '□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n■■□□□□□□□□□□□■■\n■■■□□□□□□□□□■■■\n■■■■□□□□□□□■■■■\n■■■■□□□□□□□■■■■\n■■■■□□□□□□□■■■■\n■■■■□□□□□□□■■■■\n□■■■□□□□□□□■■■□\n□□■■□□□□□□□■■□□\n□□□■□□□□□□□■□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n',
         '□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n■□□□□□□□□□□□□□■\n■■□□□□□□□□□□□■■\n■■■□□□□□□□□□■■■\n■■■□□□□□□□□□■■■\n■■■□□□□□□□□□■■■\n■■■□□□□□□□□□■■■\n■■■□□□□□□□□□■■■\n□■■□□□□□□□□□■■□\n□□■□□□□□□□□□■□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n',
         '□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n■□□□□□□□□□□□□□■\n■■□□□□□□□□□□□■■\n■■□□□□□□□□□□□■■\n■■□□□□□□□□□□□■■\n■■□□□□□□□□□□□■■\n■■□□□□□□□□□□□■■\n■■□□□□□□□□□□□■■\n□■□□□□□□□□□□□■□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n',
         '□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n■□□□□□□□□□□□□□■\n■□□□□□□□□□□□□□■\n■□□□□□□□□□□□□□■\n■□□□□□□□□□□□□□■\n■□□□□□□□□□□□□□■\n■□□□□□□□□□□□□□■\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n',
         '□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□\n']

groups = ['па', '', 'пз', '', 'пт', 'пс']

times = ['8:00-9:20  ', '9:35-10:55 ', '11:10-12:30 ', '12:45-14:05', '14:20-15:40']

anon = ['anon', 'anonymous', 'анонимно', 'анон', 'анонімно']

# Погані слова
bad_words = ['пиздануть', 'єбнувся', 'жопорвац', 'пиздяной', 'коноїбитися', 'ебля', 'распиздон', 'бомбоуебище', 'хуета', 'еблан', 'пиздюхать', 'хуево', 'пиздюліна', 'злоебучий',
             'ебаквакнуться', 'поднассать', 'ебанутий', 'блядища', 'пидар', 'пидорище', 'охующий', 'зажопить', 'блядувати', 'ёбово', 'гомосятина', 'пиздец', 'хуебяка', 'пездолочь',
             'ебло', 'лох', 'поебка', 'бля', 'хренасики', 'накритися', 'ставка', 'пиздопройобіна', "хуеб'яка", 'залуплять', 'пизды', 'хуярижити', 'поебень', 'хуетень', 'особливо',
             'ссыкло', 'обосрать', 'наебать', 'пиздати', 'ебись', 'розпиздяй', 'охрел', 'пиздюк', 'заебатый', 'уёбище', 'припизд', 'ебало', 'ебливий', 'срать', 'ебысь', 'насрать',
             'засрац', 'выхерить', 'коноебля', 'мудохать', 'просрать', 'семихуй', 'мочиться', 'съёбывать', 'трахати', 'срака', 'долбоєб', 'пиздоебля', 'поеботина', 'херовый', 'обоссанный',
             'наїбнутися', 'пиздной', 'блядство', 'засратый', 'долбоёб', 'уссываться', 'разъёба', 'ебанути', 'припиздь', 'мудель', 'охренский', 'залупчивый', 'кінчений', 'ебанат', "роз'єбай",
             'педрильо', 'мандовуха', 'херики', 'залупа', 'обоссать', 'дрочить', 'мудак', 'мозки', 'хуярить', "косообіб'тися", 'говняшка', 'настоєбеть', 'ссаными', 'пиздохулююче', 'пиздёныш',
             'хер', 'блядское', 'мудакуватий', 'жопа', 'трахать', 'хуйня', 'подосрать', 'уссачка', 'уёбывать', 'херить', 'подъёбка', 'пересрать', 'заеблись', 'мудильк', 'пиздюлина', 'мудень'
    ,        'розпиздон', 'пиздячить', 'пиздёж', 'поднасрать', 'опіздол', 'припизднутый', 'елдак', 'хуйовий', 'пиздануться', 'хуила', 'херу', 'пидорас', 'дрочити', 'похерить', 'особенно', 'мудство',
             'хреном', 'гнать', 'добздеть', 'мандавошка', 'гандошить', 'мудофель', 'ебать', 'ебир', 'хули', 'ебнутий', 'пиздопроушина', 'хуётина', 'еботятина', 'мудила', 'злоєбучий', 'наёбка',
             'пиздопроёбина', "під'єб", 'педрила', 'задца', 'пизданутий', 'хера', 'подъебать', 'перебздеть', 'пидорюга', 'хулі', 'хреновый', 'ебс', 'залупка', 'бомбоуёбище', "з'їбувати",
             'ёбнуть', 'выебнуться', 'ёбырь', 'ссать', 'дрочила', 'опиздол', 'хую', 'шароёбиться', 'спиздометр', 'пиздюля', 'серить', 'изъеб', 'пиздеж', 'манда', 'ебово', 'хитрожопый',
             'ебальк', 'обосраться', 'накрыться', 'хуй', 'подъёб', 'хуя', 'хуярити ', 'пиздити', 'мухосранск', 'залупывать', 'мудя', 'хуячити', 'похуизм', 'ебанутый', 'хуемполбія', "з'їбнутися",
             'усрись', 'пиздюхаханьки', 'проссывать', 'пиздяний', 'чмо', 'похуист', 'экскременты', 'пидарас', 'добути', 'задроченный', 'пиздолоч', 'припизднутий', 'пиздатый', 'говняный',
             'ёбнутый', 'шароєбитися', 'поебать', 'ебливый', 'уебище', 'охуительный', 'говнюк', 'ссыкун', 'фигня', 'пиздун', 'хуемполбия', 'пиздорвац', 'мандовка', 'пизданутый', 'спизжены',
             "роз'єба", 'хуйотина', 'пиздой', 'херь', 'выебнулся', 'спиздить', 'пиздячити', 'пизденьк', 'пиздёхать', 'хуярыжить', 'ебануть', 'обосранный', 'высрать', 'ебучий', 'пиздотекар',
             'засранный', 'зассатый', 'хуйнуть', 'еблысь', 'бляди', 'бляда', 'хуй ', 'наїбать', 'дерьмо', 'опиздохуительно', 'целка', 'ёбнулся', 'распиздяй', 'уебувати', 'чепиздон', 'заебатий',
             'гандон', 'прошмандовка', 'пиздний', 'настоебать', 'пиздобратия', 'хуячить', 'муха', 'усираться', 'блядун', 'пруда', 'дебил', 'оправляться', 'хрена', 'наебнуться', 'хуйовина',
             'хрен', 'виблядок', 'ёбс', 'въебенно', 'придрочитися', 'ебенити', 'мудодзвін', 'наїбка', 'изъёб', 'срун', 'гомосек', 'хрену', 'пиздувати', 'пидарасить', 'спідометр', 'русский',
             'хуёвый', 'херасики', 'похуїст', 'охуевательный', 'полухуй', 'блядовать', 'ебаться', 'сосать', 'залупливать', 'педик', 'залупщик', 'гей', 'мозги', 'срач', 'хрень', 'туебень',
             'мудаковатый', 'дерьмовый', 'похуїзм', 'говноед', 'блядське', 'изъебнуться', 'конченый', 'пидораз', 'залупать', 'сральк', 'говёный', 'задрачений', 'хуїла', 'хуєтень', 'бляха',
             'пидормот', "в'єбенно", 'пиздовать', 'виїбнувся', 'пиздить', 'пизда', 'придрочиться', 'настоебеть', 'задчный', 'уссывон', 'хуёвина', 'хером', 'бляді', 'коноёбиться', 'єбнути',
             'пидор', 'ебёныть', 'косоёбиться', 'блядь', 'пиздюхати', 'виїбнутися', 'охуеть', 'мудозвон', 'засрать', 'дурак', 'пизди', 'муда', 'пиздюшка', 'настоєбать', 'елда', 'жополиз',
             'ебатися', 'хуяк', 'хуесос', 'поёбка', 'пиздобол', 'спизжени', 'пиздоплюйство', 'выблядок', "під'їбати", 'заебательский', 'ебальник', 'ёб', "під'їбка", 'охуенный', 'разъебай',
             'напівхуй', 'хуйнути', 'заеблися', 'пиздотекарь', 'хуёво', 'изговться']


good_words = ['дякую', 'будь ласка', 'будьласка', 'перепрошую', 'доброго дня', 'вибач', 'спасибі', 'доброго ранку', 'добрий ранок', 'добрий день', 'доброго вечора', 'добрий вечір',
              'надобраніч', 'солодких снів', 'вітаю', 'благодарю', 'пожалуйста', 'пожалуйста', 'извините', 'добрый день', 'извини', 'спасибо', 'доброе утро', 'доброе утро', 'добрый день',
              'добрый вечер', 'добрый вечер', 'спокойной ночи', 'сладких снов', 'поздравляю', 'ty', 'thx', 'hi', 'hello', 'sorry', 'гарного дня', 'хорошего дня']


# Готові тексти для копіпасти
text_1 = 'Нейроанекдоты:\nМужик заходит в кафе, заказывает кофе и пирожное. Официант стоит с открытым ртом. Стрелок:\n— Что?\n— Эээ... ну вы понимаете, короче, чтоб стоял бетонно. Ко мне сегодня такие две супертелки придут, в общем, поищите самое лучшее.\n— Вот у нас с пюрешкой!\n— Ну, ладно, встретимся на обеде!'
text_2 = 'Нейроанекдоты:\nОднажды Эрнест Хемингуэй поспорил, что сможет написать самый короткий рассказ, способный растрогать любого. Он выиграл спор: "Презентация обо всех гендерах. Количество слайдов - 2."'
text_3 = 'Нейроанекдоты:\nЧто было ПРИ ОКСИМИРОНЕ. ЧТО МЫ ПОТЕРЯЛИ:\n1. I\n2. II\n3. III\n4. IV\n5. V\n6. VI\n7. VII\n8. VIII\n9. IX\n10. X'
textttt = 'Нейроанекдоты:\nПопадает колхозник на зону. Видит - мужики капусту едят.\n- А вы чего?'
text_5 = 'Нейроанекдоты:\n-Кто будет защищать тебя на голове?\n-Шляпа.\n\n-И как она?\n-Как раз.'
text_6 = 'Нейроанекдоты:\nНа тегеранской конференции Черчилль, чтобы позлить Сталина, сказал:\n— А мне приснилось, что я обосрался.'
text_7 = 'Нейроанекдоты:\n— дайте, пожалуйста, белую таблетку\n— какую?\n— белую\n— это аптека, у нас тут мемы мемы хахах наканецтаа'
text_8 = 'Нейроанекдоты:\nЖена мужу\n— Дорогой, а у тебя отвалилась жопа'
text_9 = 'Нейроанекдоты:\nУмирают три мужика и попадают в рай. А там\nКап кап\nБуль буль буль буль!'


let = 'A, B, C, D, E, F, G, H, I, J, K, L, M, N, O, P, Q, R, S, T'
let = list(let.split(', '))
texts = (text_1, text_2, text_3, text_5, text_6, text_7, text_8, text_9, textttt)

